Revit 2024 API
SelectionChangedEventArgs.GetSelectedElements Method
 Returns ElementIds of selected elements.
Namespace: Autodesk.Revit.UI.Events
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2023
Syntax
C#
public ISet<ElementId> GetSelectedElements()
Visual Basic
Public Function GetSelectedElements As ISet(Of ElementId)
Visual C++
public:
ISet<ElementId^>^ GetSelectedElements()
See Also
SelectionChangedEventArgs Class
Autodesk.Revit.UI.Events Namespace